src/__tests__/services/adwords/AdGroupAdService/addExpandedTextAd.xml

<!-- Soap request (Envelope) including headers:   -->
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:tns="https://adwords.google.com/api/adwords/cm/v201809" 
  xmlns:jaxb="http://java.sun.com/xml/ns/jaxb">
  <soap:Header>
    <ns1:RequestHeader xmlns:ns1="https://adwords.google.com/api/adwords/cm/v201809" 
      xmlns="https://adwords.google.com/api/adwords/cm/v201809">
      <ns1:clientCustomerId>153-935-9847</ns1:clientCustomerId>
      <ns1:developerToken>
        <!-- developerToken -->
      </ns1:developerToken>
      <ns1:userAgent>Nodejs Google adwords</ns1:userAgent>
      <ns1:validateOnly>false</ns1:validateOnly>
      <ns1:partialFailure>false</ns1:partialFailure>
    </ns1:RequestHeader>
  </soap:Header>
  <soap:Body>
    <mutate xmlns="https://adwords.google.com/api/adwords/cm/v201809">
      <operations xsi:type="AdGroupAdOperation">
        <operator>ADD</operator>
        <operand>
          <adGroupId>72029524744</adGroupId>
          <ad xsi:type="ExpandedTextAd">
            <finalUrls>http://delta.name</finalUrls>
            <headlinePart1>harum praesentium inventore</headlinePart1>
            <headlinePart2>sint similique dolorem</headlinePart2>
            <description>rerum quam quas</description>
          </ad>
        </operand>
      </operations>
      <operations xsi:type="AdGroupAdOperation">
        <operator>ADD</operator>
        <operand>
          <adGroupId>72029524744</adGroupId>
          <ad xsi:type="ExpandedTextAd">
            <finalUrls>http://jalen.info</finalUrls>
            <headlinePart1>est ut debitis</headlinePart1>
            <headlinePart2>velit quo inventore</headlinePart2>
            <description>natus qui sapiente</description>
          </ad>
        </operand>
      </operations>
    </mutate>
  </soap:Body>
</soap:Envelope>


<!-- Soap response body:   -->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <ResponseHeader xmlns="https://adwords.google.com/api/adwords/cm/v201809">
      <requestId>000587407868e5210a374f851e03805b</requestId>
      <serviceName>AdGroupAdService</serviceName>
      <methodName>mutate</methodName>
      <operations>2</operations>
      <responseTime>390</responseTime>
    </ResponseHeader>
  </soap:Header>
  <soap:Body>
    <mutateResponse xmlns="https://adwords.google.com/api/adwords/cm/v201809">
      <rval>
        <ListReturnValue.Type>AdGroupAdReturnValue</ListReturnValue.Type>
        <value>
          <adGroupId>72029524744</adGroupId>
          <ad xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ExpandedTextAd">
            <id>344895730005</id>
            <finalUrls>http://delta.name</finalUrls>
            <type>EXPANDED_TEXT_AD</type>
            <Ad.Type>ExpandedTextAd</Ad.Type>
            <headlinePart1>harum praesentium inventore</headlinePart1>
            <headlinePart2>sint similique dolorem</headlinePart2>
            <description>rerum quam quas</description>
          </ad>
          <status>ENABLED</status>
          <policySummary>
            <reviewState>REVIEW_IN_PROGRESS</reviewState>
            <combinedApprovalStatus>UNDER_REVIEW</combinedApprovalStatus>
          </policySummary>
        </value>
        <value>
          <adGroupId>72029524744</adGroupId>
          <ad xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ExpandedTextAd">
            <id>344895730008</id>
            <finalUrls>http://jalen.info</finalUrls>
            <type>EXPANDED_TEXT_AD</type>
            <Ad.Type>ExpandedTextAd</Ad.Type>
            <headlinePart1>est ut debitis</headlinePart1>
            <headlinePart2>velit quo inventore</headlinePart2>
            <description>natus qui sapiente</description>
          </ad>
          <status>ENABLED</status>
          <policySummary>
            <reviewState>REVIEW_IN_PROGRESS</reviewState>
            <combinedApprovalStatus>UNDER_REVIEW</combinedApprovalStatus>
          </policySummary>
        </value>
      </rval>
    </mutateResponse>
  </soap:Body>
</soap:Envelope>